app/controllers/school_classes_controller.rb

  def update
    find_school_class
    @school_class.update(school_class_params(:title, :room_number))
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-07-23 18:18:24.042110"], ["id", 1]]